; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 26437 2 1 4 8 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	thermograph0 - mode
	spectrograph3 - mode
	thermograph1 - mode
	infrared2 - mode
	GroundStation0 - direction
	Star3 - direction
	Star4 - direction
	Star6 - direction
	Star7 - direction
	Star5 - direction
	Star1 - direction
	GroundStation2 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 Star5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument1 thermograph1)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 Star1)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
)
(:goal (and
	(pointing satellite0 Star3)
	(pointing satellite1 Star5)
	(have_image Phenomenon8 thermograph0)
	(have_image Planet9 spectrograph3)
	(have_image Star10 spectrograph3)
	(have_image Phenomenon11 thermograph0)
	(have_image Star12 infrared2)
	(have_image Planet13 infrared2)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 8
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 8
3. (turn_to satellite0 star3 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star3)
   goals met: 2 of 8
4. (turn_to satellite1 groundstation2 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 groundstation2)
   goals met: 1 of 8
5. (calibrate satellite1 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 1 of 8
6. (turn_to satellite0 groundstation2 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 8
7. (turn_to satellite1 star10 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star10)
   goals met: 0 of 8
8. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 0 of 8
9. (take_image satellite1 star10 instrument1 spectrograph3)
   added: (have_image star10 spectrograph3)
   goals met: 1 of 8
10. (turn_to satellite0 star3 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star3)
   goals met: 2 of 8
11. (turn_to satellite1 planet9 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 planet9)
   goals met: 2 of 8
12. (turn_to satellite0 star12 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star12)
   goals met: 1 of 8
13. (take_image satellite1 planet9 instrument1 spectrograph3)
   added: (have_image planet9 spectrograph3)
   goals met: 2 of 8
14. (take_image satellite0 star12 instrument0 infrared2)
   added: (have_image star12 infrared2)
   goals met: 3 of 8
15. (turn_to satellite1 star5 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star5)
   goals met: 4 of 8
16. (turn_to satellite0 star3 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star3)
   goals met: 5 of 8
17. (turn_to satellite0 planet13 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 planet13)
   goals met: 4 of 8
18. (take_image satellite0 planet13 instrument0 infrared2)
   added: (have_image planet13 infrared2)
   goals met: 5 of 8
19. (turn_to satellite0 star3 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star3)
   goals met: 6 of 8
20. (turn_to satellite0 phenomenon8 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon8)
   goals met: 5 of 8
21. (take_image satellite0 phenomenon8 instrument0 thermograph0)
   added: (have_image phenomenon8 thermograph0)
   goals met: 6 of 8
22. (turn_to satellite0 star3 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 star3)
   goals met: 7 of 8
23. (turn_to satellite0 phenomenon11 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon11)
   goals met: 6 of 8
24. (take_image satellite0 phenomenon11 instrument0 thermograph0)
   added: (have_image phenomenon11 thermograph0)
   goals met: 7 of 8
25. (turn_to satellite0 star3 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 star3)
   goals met: 8 of 8
